| tstats summariesonly=t allow_old_summaries=t
    count as total_attempts 
    dc(Web.url) as unique_urls 
    values(Web.url) as url 
    values(Web.status) as status 
    values(Web.http_user_agent) as http_user_agent 
  from datamodel=Web 
  where Web.http_method="GET" Web.url="*vulnerabilities/brute*" 
  by _time span=5m, Web.src, host, Web.http_method
| rename Web.* as *, host as dest
| where total_attempts > 5 AND unique_urls > 2





