| tstats summariesonly=f allow_old_summaries=t count as http_404_count dc(Web.url) as unique_missing_files values(Web.url) as 404_paths from datamodel=Web where Web.status=404 by _time span=1m, Web.src
| rename Web.src as clientip
| where http_404_count > 15 AND unique_missing_files > 10
| eval _time=strftime(_time, "%Y-%m-%d %H:%M:%S")