| tstats summariesonly=t allow_old_summaries=t count as attempts from datamodel=Web where Web.url="*vulnerabilities/exec*" by _time span=1m, Web.src, Web.url
| rename Web.src as clientip
| eval payload=urldecode('Web.url')
| regex payload="(?i)(?:;|\\||\\|\\||&&|&|`|\\$|\\n|\\r).*(?:wget|curl|nc|netcat|awk|sed|php|python|perl|ruby|sh|bash|cmd|powershell|whoami|pwd|cat|id|ls|dir|type|ipconfig|ifconfig)|(?:base64\\s*-d|\\$\\{IFS\\}|<\\s*\\/|>\\s*\\/|\\/dev\\/(?:tcp|udp)\\/|mkfifo|(?:\\w+\\\\)+\\w+|\\\\x\\w{2})"
| stats sum(attempts) as attempts values(payload) as payloads by _time, clientip
| eval _time=strftime(_time, "%Y-%m-%d %H:%M:%S")
| table _time clientip attempts payloads