| tstats count as total_requests from datamodel=Web where Web.url="*vulnerabilities/fi*" AND (Web.url="*..*" OR Web.url="*%2e%2e*" OR Web.url="*%25*" OR Web.url="*etc*" OR Web.url="*ini*" OR Web.url="*%00*" OR Web.url="*://*" OR Web.url="*page=*") by Web.src, host, Web.http_user_agent, Web.http_method, Web.status, Web.url, sourcetype, _time span=1m
| rename Web.* as *, host as dest
| eval decoded_url=urldecode(urldecode(url))
| eval payload_count=if(match(decoded_url, "(?i)(\\.\\.[\\\\/]|\\.\\.\\.\\.|/etc/(passwd|shadow|issue|hosts|group)|win\\.ini|boot\\.ini|%00|(?:php|zip|phar|data|expect)://|page=(?:http|https|ftp|dict)://)"), total_requests, 0)
| eval error_count=if(match(status, "^[45]"), total_requests, 0)
